"use strict";
const provinceList = [
  {
    name: "北京市",
    cityList: [
      {
        name: "北京市",
        districtList: ["东城区", "西城区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云区", "延庆区"]
      }
    ]
  },
  {
    name: "上海市",
    cityList: [
      {
        name: "上海市",
        districtList: ["黄浦区", "徐汇区", "长宁区", "静安区", "普陀区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "奉贤区", "崇明区"]
      }
    ]
  },
  {
    name: "广东省",
    cityList: [
      {
        name: "广州市",
        districtList: ["越秀区", "海珠区", "荔湾区", "天河区", "白云区", "黄埔区", "番禺区", "花都区", "南沙区", "从化区", "增城区"]
      },
      {
        name: "深圳市",
        districtList: ["罗湖区", "福田区", "南山区", "宝安区", "龙岗区", "盐田区", "龙华区", "坪山区", "光明区"]
      },
      {
        name: "珠海市",
        districtList: ["香洲区", "金湾区", "斗门区"]
      },
      {
        name: "汕头市",
        districtList: ["金平区", "龙湖区", "濠江区", "潮阳区", "潮南区", "澄海区", "南澳县"]
      },
      {
        name: "佛山市",
        districtList: ["禅城区", "南海区", "顺德区", "三水区", "高明区"]
      },
      {
        name: "韶关市",
        districtList: ["浈江区", "武江区", "曲江区", "始兴县", "仁化县", "翁源县", "乳源瑶族自治县", "新丰县", "乐昌市", "南雄市"]
      },
      {
        name: "湛江市",
        districtList: ["赤坎区", "霞山区", "坡头区", "麻章区", "遂溪县", "徐闻县", "廉江市", "雷州市", "吴川市"]
      },
      {
        name: "肇庆市",
        districtList: ["端州区", "鼎湖区", "高要区", "广宁县", "怀集县", "封开县", "德庆县", "四会市"]
      },
      {
        name: "江门市",
        districtList: ["蓬江区", "江海区", "新会区", "台山市", "开平市", "鹤山市", "恩平市"]
      },
      {
        name: "茂名市",
        districtList: ["茂南区", "电白区", "高州市", "化州市", "信宜市"]
      },
      {
        name: "惠州市",
        districtList: ["惠城区", "惠阳区", "博罗县", "惠东县", "龙门县"]
      },
      {
        name: "梅州市",
        districtList: ["梅江区", "梅县区", "大埔县", "丰顺县", "五华县", "平远县", "蕉岭县", "兴宁市"]
      },
      {
        name: "汕尾市",
        districtList: ["城区", "海丰县", "陆河县", "陆丰市"]
      },
      {
        name: "河源市",
        districtList: ["源城区", "紫金县", "龙川县", "连平县", "和平县", "东源县"]
      },
      {
        name: "阳江市",
        districtList: ["江城区", "阳东区", "阳西县", "阳春市"]
      },
      {
        name: "清远市",
        districtList: ["清城区", "清新区", "佛冈县", "阳山县", "连山壮族瑶族自治县", "连南瑶族自治县", "英德市", "连州市"]
      },
      {
        name: "东莞市",
        districtList: []
      },
      {
        name: "中山市",
        districtList: []
      },
      {
        name: "潮州市",
        districtList: ["湘桥区", "潮安区", "饶平县"]
      },
      {
        name: "揭阳市",
        districtList: ["榕城区", "揭东区", "揭西县", "惠来县", "普宁市"]
      },
      {
        name: "云浮市",
        districtList: ["云城区", "云安区", "新兴县", "郁南县", "罗定市"]
      }
    ]
  },
  {
    name: "江苏省",
    cityList: [
      {
        name: "南京市",
        districtList: ["玄武区", "秦淮区", "建邺区", "鼓楼区", "浦口区", "栖霞区", "雨花台区", "江宁区", "六合区", "溧水区", "高淳区"]
      },
      {
        name: "无锡市",
        districtList: ["梁溪区", "锡山区", "惠山区", "滨湖区", "新吴区", "江阴市", "宜兴市"]
      },
      {
        name: "徐州市",
        districtList: ["鼓楼区", "云龙区", "贾汪区", "泉山区", "铜山区", "丰县", "沛县", "睢宁县", "邳州市", "新沂市"]
      },
      {
        name: "常州市",
        districtList: ["天宁区", "钟楼区", "新北区", "武进区", "金坛区", "溧阳市"]
      },
      {
        name: "苏州市",
        districtList: ["姑苏区", "虎丘区", "吴中区", "相城区", "吴江区", "昆山市", "常熟市", "张家港市", "太仓市"]
      },
      {
        name: "南通市",
        districtList: ["崇川区", "通州区", "海门区", "如东县", "启东市", "如皋市", "海安市"]
      },
      {
        name: "连云港市",
        districtList: ["连云区", "海州区", "赣榆区", "东海县", "灌云县", "灌南县"]
      },
      {
        name: "淮安市",
        districtList: ["淮安区", "淮阴区", "清江浦区", "洪泽区", "涟水县", "盱眙县", "金湖县"]
      },
      {
        name: "盐城市",
        districtList: ["亭湖区", "盐都区", "大丰区", "响水县", "滨海县", "阜宁县", "射阳县", "建湖县", "东台市"]
      },
      {
        name: "扬州市",
        districtList: ["广陵区", "邗江区", "江都区", "宝应县", "仪征市", "高邮市"]
      },
      {
        name: "镇江市",
        districtList: ["京口区", "润州区", "丹徒区", "丹阳市", "扬中市", "句容市"]
      },
      {
        name: "泰州市",
        districtList: ["海陵区", "高港区", "姜堰区", "兴化市", "靖江市", "泰兴市"]
      },
      {
        name: "宿迁市",
        districtList: ["宿城区", "宿豫区", "沭阳县", "泗阳县", "泗洪县"]
      }
    ]
  },
  {
    name: "浙江省",
    cityList: [
      {
        name: "杭州市",
        districtList: ["上城区", "下城区", "江干区", "拱墅区", "西湖区", "滨江区", "萧山区", "余杭区", "富阳区", "临安区", "桐庐县", "淳安县", "建德市"]
      },
      {
        name: "宁波市",
        districtList: ["海曙区", "江北区", "北仑区", "镇海区", "鄞州区", "奉化区", "象山县", "宁海县", "余姚市", "慈溪市"]
      },
      {
        name: "温州市",
        districtList: ["鹿城区", "龙湾区", "瓯海区", "洞头区", "永嘉县", "平阳县", "苍南县", "文成县", "泰顺县", "瑞安市", "乐清市"]
      },
      {
        name: "嘉兴市",
        districtList: ["南湖区", "秀洲区", "嘉善县", "海盐县", "海宁市", "平湖市", "桐乡市"]
      },
      {
        name: "湖州市",
        districtList: ["吴兴区", "南浔区", "德清县", "长兴县", "安吉县"]
      },
      {
        name: "绍兴市",
        districtList: ["越城区", "柯桥区", "上虞区", "新昌县", "诸暨市", "嵊州市"]
      },
      {
        name: "金华市",
        districtList: ["婺城区", "金东区", "武义县", "浦江县", "磐安县", "兰溪市", "义乌市", "东阳市", "永康市"]
      },
      {
        name: "衢州市",
        districtList: ["柯城区", "衢江区", "常山县", "开化县", "龙游县", "江山市"]
      },
      {
        name: "舟山市",
        districtList: ["定海区", "普陀区", "岱山县", "嵊泗县"]
      },
      {
        name: "台州市",
        districtList: ["椒江区", "黄岩区", "路桥区", "三门县", "天台县", "仙居县", "温岭市", "临海市", "玉环市"]
      },
      {
        name: "丽水市",
        districtList: ["莲都区", "青田县", "缙云县", "遂昌县", "松阳县", "云和县", "庆元县", "景宁畲族自治县", "龙泉市"]
      }
    ]
  },
  {
    name: "四川省",
    cityList: [
      {
        name: "成都市",
        districtList: ["锦江区", "青羊区", "金牛区", "武侯区", "成华区", "龙泉驿区", "青白江区", "新都区", "温江区", "双流区", "郫都区", "新津区", "金堂县", "大邑县", "蒲江县", "都江堰市", "彭州市", "邛崃市", "崇州市", "简阳市"]
      },
      {
        name: "自贡市",
        districtList: ["自流井区", "贡井区", "大安区", "沿滩区", "荣县", "富顺县"]
      },
      {
        name: "攀枝花市",
        districtList: ["东区", "西区", "仁和区", "米易县", "盐边县"]
      },
      {
        name: "泸州市",
        districtList: ["江阳区", "纳溪区", "龙马潭区", "泸县", "合江县", "叙永县", "古蔺县"]
      },
      {
        name: "德阳市",
        districtList: ["旌阳区", "罗江区", "中江县", "广汉市", "什邡市", "绵竹市"]
      },
      {
        name: "绵阳市",
        districtList: ["涪城区", "游仙区", "安州区", "三台县", "盐亭县", "梓潼县", "北川羌族自治县", "平武县", "江油市"]
      },
      {
        name: "广元市",
        districtList: ["利州区", "昭化区", "朝天区", "旺苍县", "青川县", "剑阁县", "苍溪县"]
      },
      {
        name: "遂宁市",
        districtList: ["船山区", "安居区", "蓬溪县", "射洪市", "大英县"]
      },
      {
        name: "内江市",
        districtList: ["市中区", "东兴区", "威远县", "资中县", "隆昌市"]
      },
      {
        name: "乐山市",
        districtList: ["市中区", "沙湾区", "五通桥区", "金口河区", "犍为县", "井研县", "夹江县", "沐川县", "峨边彝族自治县", "马边彝族自治县", "峨眉山市"]
      },
      {
        name: "南充市",
        districtList: ["顺庆区", "高坪区", "嘉陵区", "南部县", "营山县", "蓬安县", "仪陇县", "西充县", "阆中市"]
      },
      {
        name: "眉山市",
        districtList: ["东坡区", "彭山区", "仁寿县", "洪雅县", "丹棱县", "青神县"]
      },
      {
        name: "宜宾市",
        districtList: ["翠屏区", "南溪区", "叙州区", "江安县", "长宁县", "高县", "珙县", "筠连县", "兴文县", "屏山县"]
      },
      {
        name: "广安市",
        districtList: ["广安区", "前锋区", "岳池县", "武胜县", "邻水县", "华蓥市"]
      },
      {
        name: "达州市",
        districtList: ["通川区", "达川区", "宣汉县", "开江县", "大竹县", "渠县", "万源市"]
      },
      {
        name: "雅安市",
        districtList: ["雨城区", "名山区", "荥经县", "汉源县", "石棉县", "天全县", "芦山县", "宝兴县"]
      },
      {
        name: "巴中市",
        districtList: ["巴州区", "恩阳区", "通江县", "南江县", "平昌县"]
      },
      {
        name: "资阳市",
        districtList: ["雁江区", "安岳县", "乐至县"]
      },
      {
        name: "阿坝藏族羌族自治州",
        districtList: ["马尔康市", "汶川县", "理县", "茂县", "松潘县", "九寨沟县", "金川县", "小金县", "黑水县", "壤塘县", "阿坝县", "若尔盖县", "红原县"]
      },
      {
        name: "甘孜藏族自治州",
        districtList: ["康定市", "泸定县", "丹巴县", "九龙县", "雅江县", "道孚县", "炉霍县", "甘孜县", "新龙县", "德格县", "白玉县", "石渠县", "色达县", "理塘县", "巴塘县", "乡城县", "稻城县", "得荣县"]
      },
      {
        name: "凉山彝族自治州",
        districtList: ["西昌市", "木里藏族自治县", "盐源县", "德昌县", "会理市", "会东县", "宁南县", "普格县", "布拖县", "金阳县", "昭觉县", "喜德县", "冕宁县", "越西县", "甘洛县", "美姑县", "雷波县"]
      }
    ]
  },
  {
    name: "山东省",
    cityList: [
      {
        name: "济南市",
        districtList: ["历下区", "市中区", "槐荫区", "天桥区", "历城区", "长清区", "章丘区", "济阳区", "莱芜区", "钢城区", "平阴县", "商河县"]
      },
      {
        name: "青岛市",
        districtList: ["市南区", "市北区", "黄岛区", "崂山区", "李沧区", "城阳区", "即墨区", "胶州市", "平度市", "莱西市"]
      },
      {
        name: "淄博市",
        districtList: ["淄川区", "张店区", "博山区", "临淄区", "周村区", "桓台县", "高青县", "沂源县"]
      },
      {
        name: "枣庄市",
        districtList: ["市中区", "薛城区", "峄城区", "台儿庄区", "山亭区", "滕州市"]
      },
      {
        name: "东营市",
        districtList: ["东营区", "河口区", "垦利区", "利津县", "广饶县"]
      },
      {
        name: "烟台市",
        districtList: ["芝罘区", "福山区", "牟平区", "莱山区", "蓬莱区", "长岛县", "龙口市", "莱阳市", "莱州市", "招远市", "栖霞市", "海阳市"]
      },
      {
        name: "潍坊市",
        districtList: ["潍城区", "寒亭区", "坊子区", "奎文区", "临朐县", "昌乐县", "青州市", "诸城市", "寿光市", "安丘市", "高密市", "昌邑市"]
      },
      {
        name: "济宁市",
        districtList: ["任城区", "兖州区", "微山县", "鱼台县", "金乡县", "嘉祥县", "汶上县", "泗水县", "梁山县", "曲阜市", "邹城市"]
      },
      {
        name: "泰安市",
        districtList: ["泰山区", "岱岳区", "宁阳县", "东平县", "新泰市", "肥城市"]
      },
      {
        name: "威海市",
        districtList: ["环翠区", "文登区", "荣成市", "乳山市"]
      },
      {
        name: "日照市",
        districtList: ["东港区", "岚山区", "五莲县", "莒县"]
      },
      {
        name: "临沂市",
        districtList: ["兰山区", "罗庄区", "河东区", "沂南县", "郯城县", "沂水县", "兰陵县", "费县", "平邑县", "莒南县", "蒙阴县", "临沭县"]
      },
      {
        name: "德州市",
        districtList: ["德城区", "陵城区", "宁津县", "庆云县", "临邑县", "齐河县", "平原县", "夏津县", "武城县", "乐陵市", "禹城市"]
      },
      {
        name: "聊城市",
        districtList: ["东昌府区", "茌平区", "阳谷县", "莘县", "东阿县", "冠县", "高唐县", "临清市"]
      },
      {
        name: "滨州市",
        districtList: ["滨城区", "沾化区", "惠民县", "阳信县", "无棣县", "博兴县", "邹平市"]
      },
      {
        name: "菏泽市",
        districtList: ["牡丹区", "定陶区", "曹县", "单县", "成武县", "巨野县", "郓城县", "鄄城县", "东明县"]
      }
    ]
  },
  {
    name: "河南省",
    cityList: [
      {
        name: "郑州市",
        districtList: ["中原区", "二七区", "管城回族区", "金水区", "上街区", "惠济区", "中牟县", "巩义市", "荥阳市", "新密市", "新郑市", "登封市"]
      },
      {
        name: "开封市",
        districtList: ["龙亭区", "顺河回族区", "鼓楼区", "禹王台区", "祥符区", "杞县", "通许县", "尉氏县", "兰考县"]
      },
      {
        name: "洛阳市",
        districtList: ["老城区", "西工区", "瀍河回族区", "涧西区", "偃师区", "孟津区", "新安县", "栾川县", "嵩县", "汝阳县", "宜阳县", "洛宁县", "伊川县"]
      },
      {
        name: "平顶山市",
        districtList: ["新华区", "卫东区", "石龙区", "湛河区", "宝丰县", "叶县", "鲁山县", "郏县", "舞钢市", "汝州市"]
      },
      {
        name: "安阳市",
        districtList: ["文峰区", "北关区", "殷都区", "龙安区", "安阳县", "汤阴县", "滑县", "内黄县", "林州市"]
      },
      {
        name: "鹤壁市",
        districtList: ["鹤山区", "山城区", "淇滨区", "浚县", "淇县"]
      },
      {
        name: "新乡市",
        districtList: ["红旗区", "卫滨区", "凤泉区", "牧野区", "新乡县", "获嘉县", "原阳县", "延津县", "封丘县", "卫辉市", "辉县市"]
      },
      {
        name: "焦作市",
        districtList: ["解放区", "中站区", "马村区", "山阳区", "修武县", "博爱县", "武陟县", "温县", "沁阳市", "孟州市"]
      },
      {
        name: "濮阳市",
        districtList: ["华龙区", "清丰县", "南乐县", "范县", "台前县", "濮阳县"]
      },
      {
        name: "许昌市",
        districtList: ["魏都区", "建安区", "鄢陵县", "襄城县", "禹州市", "长葛市"]
      },
      {
        name: "漯河市",
        districtList: ["源汇区", "郾城区", "召陵区", "舞阳县", "临颍县"]
      },
      {
        name: "三门峡市",
        districtList: ["湖滨区", "陕州区", "渑池县", "卢氏县", "义马市", "灵宝市"]
      },
      {
        name: "南阳市",
        districtList: ["宛城区", "卧龙区", "南召县", "方城县", "西峡县", "镇平县", "内乡县", "淅川县", "社旗县", "唐河县", "新野县", "桐柏县", "邓州市"]
      },
      {
        name: "商丘市",
        districtList: ["梁园区", "睢阳区", "民权县", "睢县", "宁陵县", "柘城县", "虞城县", "夏邑县", "永城市"]
      },
      {
        name: "信阳市",
        districtList: ["浉河区", "平桥区", "罗山县", "光山县", "新县", "商城县", "固始县", "潢川县", "淮滨县", "息县"]
      },
      {
        name: "周口市",
        districtList: ["川汇区", "淮阳区", "扶沟县", "西华县", "商水县", "沈丘县", "郸城县", "太康县", "鹿邑县", "项城市"]
      },
      {
        name: "驻马店市",
        districtList: ["驿城区", "西平县", "上蔡县", "平舆县", "正阳县", "确山县", "泌阳县", "汝南县", "遂平县", "新蔡县"]
      }
    ]
  },
  {
    name: "湖北省",
    cityList: [
      {
        name: "武汉市",
        districtList: ["江岸区", "江汉区", "硚口区", "汉阳区", "武昌区", "青山区", "洪山区", "东西湖区", "汉南区", "蔡甸区", "江夏区", "黄陂区", "新洲区"]
      },
      {
        name: "黄石市",
        districtList: ["黄石港区", "西塞山区", "下陆区", "铁山区", "阳新县", "大冶市"]
      },
      {
        name: "十堰市",
        districtList: ["茅箭区", "张湾区", "郧阳区", "郧西县", "竹山县", "竹溪县", "房县", "丹江口市"]
      },
      {
        name: "宜昌市",
        districtList: ["西陵区", "伍家岗区", "点军区", "猇亭区", "夷陵区", "远安县", "兴山县", "秭归县", "长阳土家族自治县", "五峰土家族自治县", "宜都市", "当阳市", "枝江市"]
      },
      {
        name: "襄阳市",
        districtList: ["襄城区", "樊城区", "襄州区", "南漳县", "谷城县", "保康县", "老河口市", "枣阳市", "宜城市"]
      },
      {
        name: "鄂州市",
        districtList: ["梁子湖区", "华容区", "鄂城区"]
      },
      {
        name: "荆门市",
        districtList: ["东宝区", "掇刀区", "京山市", "沙洋县", "钟祥市"]
      },
      {
        name: "孝感市",
        districtList: ["孝南区", "孝昌县", "大悟县", "云梦县", "应城市", "安陆市", "汉川市"]
      },
      {
        name: "荆州市",
        districtList: ["沙市区", "荆州区", "江陵县", "公安县", "监利市", "石首市", "洪湖市", "松滋市"]
      },
      {
        name: "黄冈市",
        districtList: ["黄州区", "团风县", "红安县", "罗田县", "英山县", "浠水县", "蕲春县", "黄梅县", "麻城市", "武穴市"]
      },
      {
        name: "咸宁市",
        districtList: ["咸安区", "嘉鱼县", "通城县", "崇阳县", "通山县", "赤壁市"]
      },
      {
        name: "随州市",
        districtList: ["曾都区", "随县", "广水市"]
      },
      {
        name: "恩施土家族苗族自治州",
        districtList: ["恩施市", "利川市", "建始县", "巴东县", "宣恩县", "咸丰县", "来凤县", "鹤峰县"]
      },
      {
        name: "仙桃市",
        districtList: []
      },
      {
        name: "潜江市",
        districtList: []
      },
      {
        name: "天门市",
        districtList: []
      },
      {
        name: "神农架林区",
        districtList: []
      }
    ]
  },
  {
    name: "湖南省",
    cityList: [
      {
        name: "长沙市",
        districtList: ["芙蓉区", "天心区", "岳麓区", "开福区", "雨花区", "望城区", "长沙县", "宁乡市", "浏阳市"]
      },
      {
        name: "株洲市",
        districtList: ["荷塘区", "芦淞区", "石峰区", "天元区", "株洲县", "攸县", "茶陵县", "炎陵县", "醴陵市"]
      },
      {
        name: "湘潭市",
        districtList: ["雨湖区", "岳塘区", "湘潭县", "湘乡市", "韶山市"]
      },
      {
        name: "衡阳市",
        districtList: ["珠晖区", "雁峰区", "石鼓区", "蒸湘区", "南岳区", "衡阳县", "衡南县", "衡山县", "衡东县", "祁东县", "耒阳市", "常宁市"]
      },
      {
        name: "邵阳市",
        districtList: ["双清区", "大祥区", "北塔区", "邵东县", "新邵县", "邵阳县", "隆回县", "洞口县", "绥宁县", "新宁县", "城步苗族自治县", "武冈市"]
      },
      {
        name: "岳阳市",
        districtList: ["岳阳楼区", "云溪区", "君山区", "岳阳县", "华容县", "湘阴县", "平江县", "汨罗市", "临湘市"]
      },
      {
        name: "常德市",
        districtList: ["武陵区", "鼎城区", "安乡县", "汉寿县", "澧县", "临澧县", "桃源县", "石门县", "津市市"]
      },
      {
        name: "张家界市",
        districtList: ["永定区", "武陵源区", "慈利县", "桑植县"]
      },
      {
        name: "益阳市",
        districtList: ["资阳区", "赫山区", "南县", "桃江县", "安化县", "沅江市"]
      },
      {
        name: "郴州市",
        districtList: ["北湖区", "苏仙区", "桂阳县", "宜章县", "永兴县", "嘉禾县", "临武县", "汝城县", "桂东县", "安仁县", "资兴市"]
      },
      {
        name: "永州市",
        districtList: ["零陵区", "冷水滩区", "祁阳县", "东安县", "双牌县", "道县", "江永县", "宁远县", "蓝山县", "新田县", "江华瑶族自治县"]
      },
      {
        name: "怀化市",
        districtList: ["鹤城区", "中方县", "沅陵县", "辰溪县", "溆浦县", "会同县", "麻阳苗族自治县", "新晃侗族自治县", "芷江侗族自治县", "靖州苗族侗族自治县", "通道侗族自治县", "洪江市"]
      },
      {
        name: "娄底市",
        districtList: ["娄星区", "双峰县", "新化县", "冷水江市", "涟源市"]
      },
      {
        name: "湘西土家族苗族自治州",
        districtList: ["吉首市", "泸溪县", "凤凰县", "花垣县", "保靖县", "古丈县", "永顺县", "龙山县"]
      }
    ]
  },
  {
    name: "福建省",
    cityList: [
      {
        name: "福州市",
        districtList: ["鼓楼区", "台江区", "仓山区", "马尾区", "晋安区", "长乐区", "闽侯县", "连江县", "罗源县", "闽清县", "永泰县", "平潭县", "福清市"]
      },
      {
        name: "厦门市",
        districtList: ["思明区", "海沧区", "湖里区", "集美区", "同安区", "翔安区"]
      },
      {
        name: "莆田市",
        districtList: ["城厢区", "涵江区", "荔城区", "秀屿区", "仙游县"]
      },
      {
        name: "三明市",
        districtList: ["梅列区", "三元区", "明溪县", "清流县", "宁化县", "大田县", "尤溪县", "沙县", "将乐县", "泰宁县", "建宁县", "永安市"]
      },
      {
        name: "泉州市",
        districtList: ["鲤城区", "丰泽区", "洛江区", "泉港区", "惠安县", "安溪县", "永春县", "德化县", "金门县", "石狮市", "晋江市", "南安市"]
      },
      {
        name: "漳州市",
        districtList: ["芗城区", "龙文区", "云霄县", "漳浦县", "诏安县", "长泰县", "东山县", "南靖县", "平和县", "华安县", "龙海市"]
      },
      {
        name: "南平市",
        districtList: ["延平区", "建阳区", "顺昌县", "浦城县", "光泽县", "松溪县", "政和县", "邵武市", "武夷山市", "建瓯市"]
      },
      {
        name: "龙岩市",
        districtList: ["新罗区", "永定区", "长汀县", "上杭县", "武平县", "连城县", "漳平市"]
      },
      {
        name: "宁德市",
        districtList: ["蕉城区", "古田县", "屏南县", "寿宁县", "周宁县", "柘荣县", "福安市", "福鼎市"]
      }
    ]
  },
  {
    name: "安徽省",
    cityList: [
      {
        name: "合肥市",
        districtList: ["瑶海区", "庐阳区", "蜀山区", "包河区", "长丰县", "肥东县", "肥西县", "庐江县", "巢湖市"]
      },
      {
        name: "芜湖市",
        districtList: ["镜湖区", "弋江区", "鸠江区", "三山区", "芜湖县", "繁昌县", "南陵县", "无为市"]
      },
      {
        name: "蚌埠市",
        districtList: ["龙子湖区", "蚌山区", "禹会区", "淮上区", "怀远县", "五河县", "固镇县"]
      },
      {
        name: "淮南市",
        districtList: ["大通区", "田家庵区", "谢家集区", "八公山区", "潘集区", "凤台县", "寿县"]
      },
      {
        name: "马鞍山市",
        districtList: ["花山区", "雨山区", "博望区", "当涂县", "含山县", "和县"]
      },
      {
        name: "淮北市",
        districtList: ["杜集区", "相山区", "烈山区", "濉溪县"]
      },
      {
        name: "铜陵市",
        districtList: ["铜官区", "义安区", "郊区", "枞阳县"]
      },
      {
        name: "安庆市",
        districtList: ["迎江区", "大观区", "宜秀区", "怀宁县", "潜山市", "太湖县", "宿松县", "望江县", "岳西县"]
      },
      {
        name: "黄山市",
        districtList: ["屯溪区", "黄山区", "徽州区", "歙县", "休宁县", "黟县", "祁门县"]
      },
      {
        name: "滁州市",
        districtList: ["琅琊区", "南谯区", "来安县", "全椒县", "定远县", "凤阳县", "天长市", "明光市"]
      },
      {
        name: "阜阳市",
        districtList: ["颍州区", "颍东区", "颍泉区", "临泉县", "太和县", "阜南县", "颍上县", "界首市"]
      },
      {
        name: "宿州市",
        districtList: ["埇桥区", "砀山县", "萧县", "灵璧县", "泗县"]
      },
      {
        name: "六安市",
        districtList: ["金安区", "裕安区", "叶集区", "霍邱县", "舒城县", "金寨县", "霍山县"]
      },
      {
        name: "亳州市",
        districtList: ["谯城区", "涡阳县", "蒙城县", "利辛县"]
      },
      {
        name: "池州市",
        districtList: ["贵池区", "东至县", "石台县", "青阳县"]
      },
      {
        name: "宣城市",
        districtList: ["宣州区", "郎溪县", "广德市", "泾县", "绩溪县", "旌德县", "宁国市"]
      }
    ]
  },
  {
    name: "江西省",
    cityList: [
      {
        name: "南昌市",
        districtList: ["东湖区", "西湖区", "青云谱区", "湾里区", "青山湖区", "新建区", "南昌县", "安义县", "进贤县"]
      },
      {
        name: "景德镇市",
        districtList: ["昌江区", "珠山区", "浮梁县", "乐平市"]
      },
      {
        name: "萍乡市",
        districtList: ["安源区", "湘东区", "莲花县", "上栗县", "芦溪县"]
      },
      {
        name: "九江市",
        districtList: ["浔阳区", "濂溪区", "柴桑区", "武宁县", "修水县", "永修县", "德安县", "都昌县", "湖口县", "彭泽县", "瑞昌市", "共青城市", "庐山市"]
      },
      {
        name: "新余市",
        districtList: ["渝水区", "分宜县"]
      },
      {
        name: "鹰潭市",
        districtList: ["月湖区", "余江区", "贵溪市"]
      },
      {
        name: "赣州市",
        districtList: ["章贡区", "南康区", "赣县区", "信丰县", "大余县", "上犹县", "崇义县", "安远县", "龙南县", "定南县", "全南县", "宁都县", "于都县", "兴国县", "会昌县", "寻乌县", "石城县", "瑞金市"]
      },
      {
        name: "吉安市",
        districtList: ["吉州区", "青原区", "吉安县", "吉水县", "峡江县", "新干县", "永丰县", "泰和县", "遂川县", "万安县", "安福县", "永新县", "井冈山市"]
      },
      {
        name: "宜春市",
        districtList: ["袁州区", "奉新县", "万载县", "上高县", "宜丰县", "靖安县", "铜鼓县", "丰城市", "樟树市", "高安市"]
      },
      {
        name: "抚州市",
        districtList: ["临川区", "东乡区", "南城县", "黎川县", "南丰县", "崇仁县", "乐安县", "宜黄县", "金溪县", "资溪县", "广昌县"]
      },
      {
        name: "上饶市",
        districtList: ["信州区", "广丰区", "广信区", "玉山县", "铅山县", "横峰县", "弋阳县", "余干县", "鄱阳县", "万年县", "婺源县", "德兴市"]
      }
    ]
  },
  {
    name: "河北省",
    cityList: [
      {
        name: "石家庄市",
        districtList: ["长安区", "桥西区", "新华区", "井陉矿区", "裕华区", "藁城区", "鹿泉区", "栾城区", "井陉县", "正定县", "行唐县", "灵寿县", "高邑县", "深泽县", "赞皇县", "无极县", "平山县", "元氏县", "赵县", "辛集市", "晋州市", "新乐市"]
      },
      {
        name: "唐山市",
        districtList: ["路南区", "路北区", "古冶区", "开平区", "丰南区", "丰润区", "曹妃甸区", "滦南县", "乐亭县", "迁西县", "玉田县", "遵化市", "迁安市", "滦州市"]
      },
      {
        name: "秦皇岛市",
        districtList: ["海港区", "山海关区", "北戴河区", "抚宁区", "青龙满族自治县", "昌黎县", "卢龙县"]
      },
      {
        name: "邯郸市",
        districtList: ["邯山区", "丛台区", "复兴区", "峰峰矿区", "肥乡区", "永年区", "临漳县", "成安县", "大名县", "涉县", "磁县", "邱县", "鸡泽县", "广平县", "馆陶县", "魏县", "曲周县", "武安市"]
      },
      {
        name: "邢台市",
        districtList: ["襄都区", "信都区", "任泽区", "南和区", "临城县", "内丘县", "柏乡县", "隆尧县", "宁晋县", "巨鹿县", "新河县", "广宗县", "平乡县", "威县", "清河县", "临西县", "南宫市", "沙河市"]
      },
      {
        name: "保定市",
        districtList: ["竞秀区", "莲池区", "满城区", "清苑区", "徐水区", "涞水县", "阜平县", "定兴县", "唐县", "高阳县", "容城县", "涞源县", "望都县", "安新县", "易县", "曲阳县", "蠡县", "顺平县", "博野县", "雄县", "涿州市", "定州市", "安国市", "高碑店市"]
      },
      {
        name: "张家口市",
        districtList: ["桥东区", "桥西区", "宣化区", "下花园区", "万全区", "崇礼区", "张北县", "康保县", "沽源县", "尚义县", "蔚县", "阳原县", "怀安县", "怀来县", "涿鹿县", "赤城县"]
      },
      {
        name: "承德市",
        districtList: ["双桥区", "双滦区", "鹰手营子矿区", "承德县", "兴隆县", "平泉市", "滦平县", "隆化县", "丰宁满族自治县", "宽城满族自治县", "围场满族蒙古族自治县"]
      },
      {
        name: "沧州市",
        districtList: ["新华区", "运河区", "沧县", "青县", "东光县", "海兴县", "盐山县", "肃宁县", "南皮县", "吴桥县", "献县", "孟村回族自治县", "泊头市", "任丘市", "黄骅市", "河间市"]
      },
      {
        name: "廊坊市",
        districtList: ["安次区", "广阳区", "固安县", "永清县", "香河县", "大城县", "文安县", "大厂回族自治县", "霸州市", "三河市"]
      },
      {
        name: "衡水市",
        districtList: ["桃城区", "冀州区", "枣强县", "武邑县", "武强县", "饶阳县", "安平县", "故城县", "景县", "阜城县", "深州市"]
      }
    ]
  },
  {
    name: "山西省",
    cityList: [
      {
        name: "太原市",
        districtList: ["小店区", "迎泽区", "杏花岭区", "尖草坪区", "万柏林区", "晋源区", "清徐县", "阳曲县", "娄烦县", "古交市"]
      },
      {
        name: "大同市",
        districtList: ["新荣区", "平城区", "云冈区", "云州区", "阳高县", "天镇县", "广灵县", "灵丘县", "浑源县", "左云县"]
      },
      {
        name: "阳泉市",
        districtList: ["城区", "矿区", "郊区", "平定县", "盂县"]
      },
      {
        name: "长治市",
        districtList: ["潞州区", "上党区", "屯留区", "潞城区", "襄垣县", "平顺县", "黎城县", "壶关县", "长子县", "武乡县", "沁县", "沁源县"]
      },
      {
        name: "晋城市",
        districtList: ["城区", "沁水县", "阳城县", "陵川县", "泽州县", "高平市"]
      },
      {
        name: "朔州市",
        districtList: ["朔城区", "平鲁区", "山阴县", "应县", "右玉县", "怀仁市"]
      },
      {
        name: "晋中市",
        districtList: ["榆次区", "太谷区", "榆社县", "左权县", "和顺县", "昔阳县", "寿阳县", "祁县", "平遥县", "灵石县", "介休市"]
      },
      {
        name: "运城市",
        districtList: ["盐湖区", "临猗县", "万荣县", "闻喜县", "稷山县", "新绛县", "绛县", "垣曲县", "夏县", "平陆县", "芮城县", "永济市", "河津市"]
      },
      {
        name: "忻州市",
        districtList: ["忻府区", "定襄县", "五台县", "代县", "繁峙县", "宁武县", "静乐县", "神池县", "五寨县", "岢岚县", "河曲县", "保德县", "偏关县", "原平市"]
      },
      {
        name: "临汾市",
        districtList: ["尧都区", "曲沃县", "翼城县", "襄汾县", "洪洞县", "古县", "安泽县", "浮山县", "吉县", "乡宁县", "大宁县", "隰县", "永和县", "蒲县", "汾西县", "侯马市", "霍州市"]
      },
      {
        name: "吕梁市",
        districtList: ["离石区", "文水县", "交城县", "兴县", "临县", "柳林县", "石楼县", "岚县", "方山县", "中阳县", "交口县", "孝义市", "汾阳市"]
      }
    ]
  }
];
exports.provinceList = provinceList;
//# sourceMappingURL=../../.sourcemap/mp-weixin/utils/areaData.js.map
